my-config-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My configuration system</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="My configuration system"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-16 21:48:58 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">My configuration system</h1>

<p>我的配置系统是github上的一个项目，<a href="https://github.com/baohaojun/windows-config">Windows-config</a>。
</p>
<p>
里面最开始只是我的.bashrc、.emacs等文件，但很快我就把它的目标修正为：当
我新安装一台机器后，我可以通过一个简单的 <code>git clone --recursive http://github.com/baohaojun/windows-config</code> 和额外的几条脚本，把
我的个人环境快速重建出来。
</p>
<p>
整个项目必须checkout到你的 <code>$HOME/windows-config</code> 下。你可能会觉得奇
怪，.bashrc/.emacs等文件不是应该放在 <code>$HOME/</code> 下吗，为什么要放到一个叫
windows-config的子目录下呢？别急，听我慢慢道来:-)
</p>
<p>
这其实是两个问题：
</p>
<ul>
<li>为什么要子目录？你自己试试就知道了，因为不用子目录，直接放在
  <code>$HOME/</code> 下的话，你每次跑 <code>git status</code> 会被烦死的，因为会有很多其它系
  统自动生成的配置文件、log文件等。你难道能不停更新你的.gitignore？你难
  道能忍住、记住不能在 <code>$HOME/</code> 下跑 <code>git clean -xfd</code> （会把所有非git版
  本管理文件全部删除，泪啊）？

</li>
<li>为什么叫windows-config？这只是个巧合而已，最开始的时候我正在公司的
  windows机器上用cygwin，所以其配置文件就叫windows-config了。本来计划在
  linux底下搞个linux-config的，但后来发现完全没必要，它们可以用设计模式
  中factory的模式共用大部分代码，见<a href="./fun-design-pattern.html">在shell脚本里的抽象工厂模式</a>:-)
</li>
</ul>


<p>
最后，“额外的几条脚本”是指何意？把代码checkout到
<code>$HOME/windows-config/</code> 下之后，只要记得跑这两条命令就搞定了：
</p>



<pre class="src src-sh">~/windows-config/bin/after-co-ln-s.sh
~/windows-config/bin/Linux/after-check-out.sh
</pre>


<p>
其中第一条就是要把相应的该放在 <code>$HOME</code> 下的文件/目录通过symlink给放出来，
让bash/emacs等程序能读到。用symlink而不是拷贝出来有一个额外的好处，你能
猜到 <a href="./why-symlink-my-config.html">是什么</a> 吗？第二条则是做一些.deb包的安装、编译工作。
</p>
<p>
其中.deb包的安装有点意思，可以跟大家说说：
</p>
<ul>
<li>用文件系统作数据库。我每次发现自己希望默认该装什么包，我就以该包的名
  字在某配置目录（ <code>/home/bhj/bin/Linux/config/pkgs/</code> ）下生成一个文件。
  参见ESR的<a href="http://www.catb.org/esr/writings/taoup/">The Art of Unix Programming</a>。

<p>
  我会把所有文件都作为参数传给 <code>apt-get intstall</code> 。
</p>
</li>
<li>安装出错的自动处理。随着时间推移，或者我从debian换到ubuntu或者反之，
  有些包可能会找不到了。这时候我们只需要把 <code>apt-get install</code> 的
  stdout/stderr结果记下来，parse一下，再把出错的包从它的参数列里拿掉再
  来一遍（实际上是一个while循环）就好了。
</li>
</ul>


<p>
最后，欢迎大家试用我的配置系统，并多提改进意见:-)
</p></div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
